SunCity/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/ТипыНоменклатуры/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает текст подсказки по типу номенклатуры
//
// Параметры:
//  ТипНоменклатуры	 - ПеречислениеСсылка.ТипыНоменклатуры
// 
// Возвращаемое значение:
//   Строка
//
Функция ПодсказкаПоТипуНоменклатуры(ТипНоменклатуры) Экспорт
	
	Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
		Возврат НСтр("ru = 'Материальные ценности, которые закупаются, производятся, реализуются предприятием и учитываются на складах. Возможен контроль остатков на складах, учет себестоимости, обеспечение потребностей и др.'");
	ИначеЕсли ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
		Возврат НСтр("ru = 'Нематериальные ценности, которые закупаются предприятием или реализуются клиентам. Для услуг не ведется учет себестоимости. В момент приобретения услуги указывается статья расходов, определяющая дальнейший учет расходов.'");
	ИначеЕсли ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат Тогда
		Возврат НСтр("ru = 'Материальные ценности, которые впоследствии применяются к оплате'");
	Иначе
		Возврат НСтр("ru = 'Определяет возможности по учету номенклатуры в различных механизмах'");
	КонецЕсли;	
	
КонецФункции

Функция ВключеныФООсобенностейУчетаНоменклатуры() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ВестиСведенияДляДекларацийПоАлкогольнойПродукции")
		ИЛИ ПолучитьФункциональнуюОпцию("ВестиУчетМаркировкиПродукцииВГИСМ")
		ИЛИ ПолучитьФункциональнуюОпцию("ВестиУчетПодконтрольныхТоваровВЕТИС")
		//ИнтеграцияИСМПТК
		ИЛИ ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемогоТабакаИСМПТК")
		ИЛИ ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойОбувиИСМПТК")
		ИЛИ ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемыхЛекарствИСМПТК")
		ИЛИ ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойМолочкиИСМПТК")
		ИЛИ ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемогоТекстиляИСМПТК")
		//Конец ИнтеграцияИСМПТК;
		ИЛИ ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМП");
КонецФункции

#КонецОбласти
